data_generation/Case5/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        DICGaussSeidel;
    }

    "(U|k|epsilon|nuTilda|omega)"
    {
        solver          PBiCG;//smoothSolver;
	preconditioner  DILU;
        //smoother      symGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }

    Phi
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-06;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-3;
        U               1e-6;

//        "(k|nuTilda|epsilon|omega|f|v2)" 1e-5;
    }
}

relaxationFactors
{
    fields
    {
	p 	0.3;		
    }	

    equations
    {
        U               0.5; //0.9
        nuTilda		0.3;
	
	//".*"            0.5; //0.7
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}


// ************************************************************************* //

