data_generation/Case5/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");
writeControl    writeTime;
fields         (R devReff nuEff);
